tutorials/pM4F-Benchmarks/case5/constant/phreeqcInputChristophe
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       IOobject;
    location    "constant";
    object      phreeqcInput;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
SOLUTION 0
	temp 25
	pH 3
	-units mmol/kgw
	redox		O(-2)/O(0)
	pe 14 
	C 10
	Ca 0.1
	S 100
	Fe 22.3 O(-2)/O(0)
	Al 14.3
	K 0.0767
	Na 90.92
	O(0) 1 O2(g) -1
END

# CELLS WITH CALCITE
SOLUTION 1
	temp 25
	pH 8.01
	pe -0.67
	redox		O(-2)/O(0)
	-units mmol/kgw
	Ca 0.169512 Calcite 0 #0.471
	S 0.169512 #0.17
	Fe 1e-2 Ferrihydrite 0 #2.53e-5 O(-2)/O(0)
	Al 1e-2 Gibbsite 0 #2.81e-4
	K 0.01
	Na 1e-12 charge #1.54
	C 1 Siderite 0 #2.19
	O(0) 1 O2(g) -53.82 
END
