tutorials/pM4F-Benchmarks/case5/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

start   (0.0125 0.05 0.05);
end     (1.9875 0.05 0.05);
fields  (eps p K Ys.Calcite Ys.Gypsum Ys.Ferrihydrite Ys.Gibbsite Ys.Siderite Ys.Jarosite);

// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

// Override settings here, e.g.

setConfig
{
    axis x;        // y, z, xyz
    nPoints		80;
}


// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
